Revit 2024 API
PulldownButton.GetItems Method
Gets a copy of the collection of buttons assigned to the pulldown button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<PushButton> GetItems()
Visual Basic
Public Function GetItems As IList(Of PushButton)
Visual C++
public:
IList<PushButton^>^ GetItems()
See Also
PulldownButton Class
Autodesk.Revit.UI Namespace